src/InformationRegisters/РодственныеСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РодственныеСвязи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтепеньРодства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаконныйПредставитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийБонусныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийНакопительныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыДокументаЗаконногоПредставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/РодственныеСвязи/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтепеньРодстваПредставление = Запись.СтепеньРодства.КемПриходится;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ОбратнаяЗаписьЗапись = РегистрыСведений.РодственныеСвязи.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ОбратнаяЗаписьЗапись, ТекущийОбъект);
	ОбратнаяЗаписьЗапись.Контрагент = ТекущийОбъект.Родственник;
	ОбратнаяЗаписьЗапись.Родственник = ТекущийОбъект.Контрагент;
	
	Если НЕ ЗначениеЗаполнено(ОбратнаяЗаписьЗапись.Контрагент.ПолКлиента) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У пациента "+ОбратнаяЗаписьЗапись.Контрагент+" не заполнен пол. Определить обратную родственную связь нельзя.");	
		Отказ = Истина;
				
	Иначе
		
		ОбратнаяЗаписьЗапись.СтепеньРодства = Справочники.СтепеньРодства.ПолучитьОбратнуюСтепеньРодства(ТекущийОбъект.СтепеньРодства, ОбратнаяЗаписьЗапись.Контрагент.ПолКлиента);
		Если ЗначениеЗаполнено(ОбратнаяЗаписьЗапись.СтепеньРодства) Тогда
			ОбратнаяЗаписьЗапись.Записать();
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В настройках степени родства не указано обратное родство!");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

  #Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.Контрагент) И ЗначениеЗаполнено(Запись.Родственник)
			И Запись.Контрагент = Запись.Родственник Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Клиент не может являться сам себе родственником!");
		Запись[Элемент.Имя] = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтепеньРодстваОткрытие(Элемент, СтандартнаяОбработка)
	
	ПоказатьЗначение(,Запись.СтепеньРодства);
	
КонецПроцедуры

&НаКлиенте
Процедура СтепеньРодстваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = ПолучитьСписокВыбораСтепенейРодства();
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("СтепеньРодстваОбработкаВыбора", ЭтотОбъект), СписокВыбора, Элемент, СписокВыбора.НайтиПоЗначению(Запись.СтепеньРодства));
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Степень родства обработка выбора
//
// Параметры:
//  ВыбранныйЭлемент		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура СтепеньРодстваОбработкаВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Запись.СтепеньРодства = Результат.Значение;
		СтепеньРодстваПредставление = Результат.Представление;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокВыбораСтепенейРодства()
	
	СписокВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	               |	СтепеньРодства.Ссылка,
	               |	СтепеньРодства.КемПриходится
	               |ИЗ
	               |	Справочник.СтепеньРодства КАК СтепеньРодства
	               |ГДЕ
	               |	СтепеньРодства.ПометкаУдаления = ЛОЖЬ";
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		СписокВыбора.Добавить(Результат.Ссылка, Результат.КемПриходится);
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

 #КонецОбласти
